//
//  GameView.swift
//  GuessWho
//
//  Created by Charlie Kim on 8/15/25.
//

import SwiftUI

let gameData: [String: [String]] = [
    "캐치 티니핑": [
        "하츄핑", "바로핑", "아자핑", "차차핑", "라라핑", "해핑",
        "키키핑", "아잉핑", "부끄핑", "부투핑", "깜빡핑", "띠용핑",
        "주르핑", "차나핑", "따라핑", "나르핑", "무셔핑", "투투핑",
        "차캐핑", "떠벌핑", "다조핑", "화나핑", "시러핑", "바네핑",
        "덜덜핑", "그림핑", "무거핑", "꺼꿀핑", "씽씽핑", "베베핑",
        "코자핑", "딱풀핑", "모야핑", "토이핑", "또까핑", "플라핑",
        "노리핑", "노라핑", "아휴핑", "똑똑핑", "꽁꽁핑", "찌릿핑",
        "홀로핑", "앙대핑", "악동핑"
    ],
    "보석 티니핑": [
        "다이아하츄핑", "조아핑", "방글핑", "믿어핑", "까르핑",
        "아야핑", "소원핑", "토닥핑", "쪼꼼핑", "싹싹핑", "맛나핑",
        "포근핑", "메모핑", "공쥬핑", "짝짝핑", "주네핑", "뚝딱핑",
        "발레핑", "원더핑"
    ],
    "열쇠 티니핑": [
        "플로라하츄핑", "꾸래핑", "나나핑", "솔찌핑", "행운핑",
        "빨리핑", "얌얌핑", "뜨거핑", "삐뽀핑", "간호핑", "힘내핑",
        "고쳐핑", "아라핑", "패션핑", "꼼딱핑", "퐁당핑", "파티핑",
        "꾸며핑", "삐짐핑", "아아핑", "빙글핑"
    ],
    "새콤달콤 티니핑": [
        "베리하츄핑", "포실핑", "말랑핑", "샤샤핑", "새콤핑", "달콤핑",
        "캔디핑", "머랭핑", "샌드핑", "또너핑", "와플핑", "롤리핑",
        "마카핑", "핫케핑", "커핑머핑", "요거핑", "눈꽃핑", "푸딩핑",
        "멜로핑", "쪼꼬핑", "뿌뿌핑"
    ],
    "슈팅스타 티니핑": [
        "스타하츄핑", "빛나핑", "초롱핑", "빤짝핑", "왕자핑", "오로라핑",
        "깡총핑", "훌라핑", "나눔핑", "딩동핑", "나그네핑", "고고핑",
        "뿌쵸핑", "고마핑", "아롱핑", "다롱핑", "뽀송핑", "유리핑", "함께핑",
        "댄스핑", "여우핑", "루루핑", "몰래핑", "뽀뽀핑"
    ],
    "전체 티니핑": [
        "하츄핑", "바로핑", "아자핑", "차차핑", "라라핑", "해핑",
        "키키핑", "아잉핑", "부끄핑", "부투핑", "깜빡핑", "띠용핑",
        "주르핑", "차나핑", "따라핑", "나르핑", "무셔핑", "투투핑",
        "차캐핑", "떠벌핑", "다조핑", "화나핑", "시러핑", "바네핑",
        "덜덜핑", "그림핑", "무거핑", "꺼꿀핑", "씽씽핑", "베베핑",
        "코자핑", "딱풀핑", "모야핑", "토이핑", "또까핑", "플라핑",
        "노리핑", "노라핑", "아휴핑", "똑똑핑", "꽁꽁핑", "찌릿핑",
        "홀로핑", "앙대핑", "악동핑",
        
        "다이아하츄핑", "조아핑", "방글핑", "믿어핑", "까르핑",
        "아야핑", "소원핑", "토닥핑", "쪼꼼핑", "싹싹핑", "맛나핑",
        "포근핑", "메모핑", "공쥬핑", "짝짝핑", "주네핑", "뚝딱핑",
        "발레핑", "원더핑",
        
        "플로라하츄핑", "꾸래핑", "나나핑", "솔찌핑", "행운핑",
        "빨리핑", "얌얌핑", "뜨거핑", "삐뽀핑", "간호핑", "힘내핑",
        "고쳐핑", "아라핑", "패션핑", "꼼딱핑", "퐁당핑", "파티핑",
        "꾸며핑", "삐짐핑", "아아핑", "빙글핑",
        
        "베리하츄핑", "포실핑", "말랑핑", "샤샤핑", "새콤핑", "달콤핑",
        "캔디핑", "머랭핑", "샌드핑", "또너핑", "와플핑", "롤리핑",
        "마카핑", "핫케핑", "커핑머핑", "요거핑", "눈꽃핑", "푸딩핑",
        "멜로핑", "쪼꼬핑", "뿌뿌핑",
        
        "스타하츄핑", "빛나핑", "초롱핑", "빤짝핑", "왕자핑", "오로라핑",
        "깡총핑", "훌라핑", "나눔핑", "딩동핑", "나그네핑", "고고핑",
        "뿌쵸핑", "고마핑", "아롱핑", "다롱핑", "뽀송핑", "유리핑", "함께핑",
        "댄스핑", "여우핑", "루루핑", "몰래핑", "뽀뽀핑"
    ]
]

struct GameView: View {
    var title: String
    var subTitle: String
    
    @State private var showGuessView = false
    
    var body: some View {
        Text("축하합니다.")
            .navigationTitle(subTitle)
            .fullScreenCover(isPresented: $showGuessView) {
                GuessView(items: chooseRandomItems())
            }
            .onAppear {
                showGuessView = true
            }
    }
    
    func chooseRandomItems() -> Array<String> {
        if let data = gameData[subTitle] {
            return Array(data.shuffled())
        }
        return []
    }
}

#Preview {
    GameView(title: "티니핑 이름 맞추기", subTitle: "열쇠 티니핑")
}
